[
    "Skepticisms is the longest word that alternates hands when typing.",
    "the supersonic Concorde jet made its first trial flight on January 1st 1969",
    "A honeybee's top speed is 24kph (15mph)",
    "the frozen foods were first introduced in the 1920.",
    "In Albania, nodding your head means 'no' and shaking your head means 'yes'.",
    "Frozen lobsters can come back to life when thawed!",
    "money is the number one thing that couples argue about",
    "The current world record holder of the 100m sprint race is Usain BOLT from Jamaica. (72 sec)",
    "a piece of paper cannot be folded more than 7 times",
    "Polar bear fur is not white, it's clear.",
    "A crocodile always grows new teeth to replace the old teeth!",
    "blonde beards grow faster than darker beards",
    "A fully loaded supertanker traveling at normal speed takes a least twenty minutes to stop.",
    "the typewriter was invented in 1829",
    "A full-grown bear can run as fast as a horse.",
    "The typical spec of dust that you see floating in the air is half way in size between the Earth and a subatomic particle.",
    "a connected bunch of bananas is called a hand and individual bananas are called fingers",
    "Viswanathan Anand won \"Chess Oscar\"award 5 times. (1997 1998 2003 2004 2007)",
    "34% of Microsoft employees are Indians.",
    "In Tokyo, they sell toupees for dogs!",
    "The penguin is the only bird that can swim, but cannot fly.",
    "bottle nosed whales can dive to a depth of 915 metres (3,000feet) in 2 minutes",
    "Each day, up to 150 species of life become extinct.",
    "cheetahs can accelerate from 0 to 70 km/h (43mp/h) in 3 seconds",
    "Contrary to popular beliefs, chocolate does not cause acne.",
    "In 1999, Pepsi, Inc. paid $0.00 in income tax!",
    "there is no butter in buttermilk",
    "you have to eat 5kg (11lb) of potatoes to put on .5kg (1lb) of weight (a potato has no more calories than an apple)",
    "Giant Panda Bears give birth to a 4 ounce Baby Panda!",
    "Tokyo was once known as Edo",
    "A B-25 bomber airplane crashed into the 79th floor of the Empire State Building on July 28, 1945.",
    "Women have a slightly higher average IQ than men.",
    "men are stuck by lightning 7 times more than women",
    "ichthyophobia is the fear of fish",
    "21% of people don't make their bed in the morning",
    "ants don't like baby powder (talcum powder)",
    "The Muppet Show was banned from Saudi Arabian TV becuase one if its stars was a pig.",
    "The average soccer ball is made up of 32 leather panels and held together by 642 stitches.",
    "a giraffe can go longer without water than a camel",
    "Enrico Caruso and Roy Orbison were the only tenors this century capable of hitting e over high c!",
    "every year over 98% of atoms in your body are replaced",
    "artificial Christmas trees have outsold real ones every year since 1991",
    "Che Guevara suffered from asthma!",
    "Every year, Alaska has about 5,000 earthquakes.",
    "all of the clocks in the movie 'Pulp Fiction' are fixed to 4:20",
    "Gmail was launched as an invitation-only beta release on April 1 2004 and it became available to the general public on February 7 200",
    "Even though lionesses make the hunt they eat the prey only after the males have had their full. The cubs eat after the lionesses.",
    "If the population of China walked past you in single file, the line would never end because of the rate of reproduction.",
    "People that suffer from gum disease are twice as likely to have a stroke or heart attack.",
    "'Canberra' is the capital of 'Australia'.",
    "the cheetah is the only cat that can't retract it's claws",
    "Mohanlal has received 10 National Award nominations in the Best Actor category. More nominations than any other actor.",
    "Ancient Romans at one time used human urine as an ingredient in their toothpaste.",
    "Contrary to popular belief, hair does not grow back darker and thicker after it has been shaved.",
    "hiccups usually lasts for 5 minutes",
    "humans are the only primates that don't have pigment in the palms of their hands",
    "Billy goats urinate on their own heads to smell more attractive to females.",
    "In Nepal, cow dung is used for medicinal purposes.",
    "a standard 747 jumbo jet has 420 seats",
    "toads only eat moving prey",
    "an ostriches can outrun a horse",
    "During his lifetime, artist Vincent Van Gogh only sold one of his paintings.",
    "reindeer like bananas",
    "Spider monkeys like banana daiquiris.",
    "the last Play Boy centerfold to have staples was published in 1985",
    "There is a giant mushroom in Oregon that is over 2,400 years old, covers 3.4 square miles of land, and is still growing!",
    "the word 'almost' is the longest word spelt alphabetically",
    "The weight of a carat (200 milligrams), standard unit of measurement for gemstones, is based on the weight of the carob seed.",
    "The most popular first name in the world is Muhammad!",
    "the most commonly forgotten item for travelers is their toothbrush",
    "there are over 100 different viruses that cause the common cold",
    "A volcano has enough power to shoot ash as high as 50 km into the atmosphere.",
    "The poison-arrow frog has enough poison to kill about 2,200 people!",
    "wheat is the world's most widely grown plant",
    "Reindeer milk has more fat than cow milk.",
    "Roosters can't crow if they can't fully extend their necks.",
    "The scientific name for the domestic dog is 'Canis lupis familiaris'.",
    "Each year, the average family uses about 18,000 gallons of water just to do its laundry!",
    "draughts (checkers) is older than chess",
    "ornithophobia is the fear of birds",
    "DUEL (1971) was the first feature film directed by Steven Spielberg and was written by Richard Matheson based on his own short story.",
    "The starfish is one of the few animals who can turn it's stomach inside-out!",
    "petrol has no specific freezing point (it can freezes at any temperature between -82 and -115C (-180 and -240F)",
    "In 1910 football teams were penalized 15 yards for an incompleted forward pass.",
    "Cashew nut shells contain oil that is extremely irritating to human skin.",
    "caterpillars have over 2,000 muscles",
    "If your skin is laid flat it will cover an area of 18 square feet.",
    "french fries are originally from Belgium",
    "Strawberries have more vitamin c than oranges.",
    "The chances of you dying on the way to get your lottery tickets is greater than your chances of winning.",
    "Iceland has no railway system or army!",
    "Manhattan Island of New York City was purchased for $24 from the Algonquian Indians in 1624!",
    "diamonds are the hardest natural substance",
    "snakes can't blink",
    "There are no rental cars in Bermuda.",
    "the tentacles of the giant arctic jellyfish can reach 36.6 meters (120 feet)",
    "there is enough petrol in a full tank of a Jumbo Jet to drive the average car 4 times around the world",
    "the average life span of a mosquito is 2 weeks",
    "Unlike all other insects flies have five eyes. They have two large eyes and three smaller eyes between them.",
    "cats have a peripheral vision of 285 degrees",
    "an astronaut can be up to 2 inches taller returning from space (the cartilage disks in the spine expand in the absence of gravity)",
    "scorpions glow under ultra violet light",
    "India has a Bill of Rights for cows.",
    "household dust is made of dead skin cells",
    "Turtles can live for more than 100 years.",
    "There are only 14 blimps in the world.",
    "The most popular Campbell's Soup in Hong Kong is watercress and duck gizzard.",
    "During a typical human life span, the human heart will beat approximately 2.5 billion times.",
    "Check your map!  The Pacific entrance of the Panama Canal is farther East than the Atlantic entrance.",
    "volleyball was invented in 1895",
    "an office desk has 400 times more bacteria than a toilet",
    "there is 200 times more gold in the world's oceans than has been mined",
    "it took Leonardo Da Vinci 10 years to paint Mona Lisa",
    "bananas are a good source of vitamin C, potassium and fiber",
    "a bumble bee flaps its wings at 160 times a second",
    "President Bush and Saddam Hussein both have their shoes made by the same Italian shoemaker!",
    "over a third of all pineapples come from Hawaii",
    "According to legend, there’s a Superman in every episode of Seinfeld.",
    "tarantula spiders can survive 2 and a half years without food",
    "Pollen can travel up to 500 miles in a day.",
    "Malaysians protect their babies from disease by bathing them in beer.",
    "Clocks made before 1660 had only one hand - an hour hand.",
    "The aorta, the largest artery in the body, is almost the diameter of a garden hose.",
    "DVDs are physically the same size as a CDs but can store 13 times more data",
    "You are born with 300 bones; by the time you are an adult you will have 206.",
    "Sound at the right vibration can bore holes through a solid object.",
    "people in Iceland read more books per capita than any other country",
    "The temperature of the earth's interior increases by 1 degree every 60 feet down.",
    "'Jana Gana Mana' was officially adopted by the Constituent Assembly as the Indian national anthem on January 24 1952",
    "One in 500 humans has one blue eye and one brown eye.",
    "the human body contains 96,000km(59,650miles) of blood vessels",
    "Most people who read the word 'yawning' will yawn!",
    "paper money was first used in China",
    "Mohandas Karamchand Gandhi'ji born on 2nd october 186",
    "more people are allergic to cows milk than any other food",
    "the yo-yo was originally used as a weapon for hunting the in the Philippines",
    "The oil used by jewelers to lubricate clocks and watches costs about $3,000 a gallon.",
    "The powder on chewing gum is finely-ground marble.",
    "the safest car color is white",
    "Black bears are not always black. They can be brown, cinnamon, yellow, and sometimes white.",
    "a group of foxes is called a skulk",
    "SONY was originally called 'Totsuken'.",
    "Owls are one of the only birds who can see the color blue!",
    "\"Mobira Senator\"is the first mobile phone model launched by Nokia in 198",
    "If you flip a coin ten times, the odds against its coming up with the same side showing each time are 1,023 to 1.",
    "Honey is used sometimes for antifreeze mixtures and in the center of golf balls.",
    "Surprisingly an average little mosquito has 47 teeth.",
    "there are more chickens than people",
    "tennis was originally played with bare hands",
    "that you can spell the word 'level' the same backwards",
    "The normal static electricty shock that zaps your finger when you touch a doorknob is usually between 10,000 and 30,000 volts!",
    "the diameter of the sun is 1,390,000km (865,000 miles)",
    "the most common injury in ten pin bowling is a sore thumb",
    "The Japanese liquor, Mam, uses venomous snakes as one of its main engredients.",
    "40% of Amsterdam commuters get to work by bicycle",
    "The average tastebud lives only 10 days before it dies and is replaced by a new one.",
    "instant coffee was invented in 1901",
    "The inventor of Vaseline ate a spoonful of the stuff every morning!",
    "59% of people say that their average looking",
    "Worms reportedly taste like bacon.",
    "Fear of blood is called as 'Hemaphobia'.",
    "the sentence \"the quick brown fox jumps over the lazy dog\" uses every letter in the English alphabet",
    "80% of the world's rose species come from Asia",
    "In Belgium there is a museum just for strawberries.",
    "Muhammad is the most common name in the world.",
    "People generally read 25% slower from a computer screen compared to paper.",
    "It is illegal for tourists to enter Mexico with more than 2 CD's!",
    "An 'aglet' is the plastic or metal tip of a shoelace.",
    "in 1878 the first telephone book made contained only 50 names",
    "Only one out of a thousand baby sea turtles survives after hatching.",
    "Bananas contain a natural chemical which can make a person happy. This same chemical is also found in Prozac.",
    "All the pet hamsters in the world are descended from a single wild golden Hamster found in Syria in 1930!",
    "It snows more in the Grand Canyon than it does in Minneapolis, Minnesota.",
    "every square inch of the human body has an average of 32 million bacteria on it",
    "ombrophobia is the fear of rain",
    "The original title of Jane Austen's novel Pride and Prejudice was First Impression!",
    "brontophobia is the fear of thunderstorms",
    "Snakes & Ladders one of the most widely played board games was created by the 13th century poet Saint Gyandev (India).",
    "It's possible to lead a cow upstairs, but not downstairs.",
    "If water in our body is reduced by 10% we will die.",
    "the word fortnight is a contraction of the 2 words 'fourteen nights'",
    "1 gigayear = 1,000,000,000,000 years",
    "Ancient Egyptians slept on pillows made of stone.",
    "Sir Isaac Newton was 23 when he discovered the law of gravity.",
    "clinophobia is the fear of going to bed",
    "The mother of the boy Michael Jackson is accused of abusing him as Janet Jackson.",
    "chalk is made from tiny plankton fossils",
    "Ernest Vincent Wright wrote a novel, Gadsby, which contains over 50,000 words -- none of them with the letter E!",
    "Until the nineteenth century, solid blocks of tea were used as money in Siberia.",
    "The most collect calls are made on Father's Day.",
    "Tallest Mountain on Earth from Base to Peak - Mauna Kea Hawaii: 33480 feet (rising to 13796 feet above sea level)",
    "There are no words in the dictionary that rhyme with: orange, purple, and month! Interesting tries from our readers: orange: door hinge, melange (French for mix) purple: hurtle, durple?, turtle month: once, bunth?, hunch",
    "In Mel Brooks' 'Silent Movie,' mime Marcel Marceau is the only person who has a speaking role.",
    "The world’s youngest parents were 8 and 9 and lived in China in 1910.",
    "There are more than one million animal species on Earth!",
    "Every hour one billion cells in the body must be replaced.",
    "most of the Vitamin C found in fruits is in the skin",
    "M*A*S*H stood for 'Mobile Army Surgical Hospital'",
    "Word \"Science\"derives from Latin word scientia meaning knowledge.",
    "Rain contains vitamin B12.",
    "Mozilla Firefox was originally created by Dave Hyatt and Blake Ross as part of an experimental project.",
    "Google consists of over 450000 servers racked up in clusters located in data centers around the world.",
    "The population of the Earth has more than doubled since 1950.",
    "15 million gallons of wine were destroyed in the 1906 San Francisco earthquake.",
    "By partially filling saucers with vinegar and distributing the saucers around a room, you can eliminate odors.",
    "fire usually moves faster uphill than downhill",
    "a cheetahs top speed is 114kph (70mph)",
    "there are more than 50 different kinds of kangaroos",
    "Jamaica has 120 rivers",
    "A toothbrush within 6 feet of a toilet can get airborne bacteria from flushing.",
    "'underground' is the only word that begins and ends with the letters 'und'",
    "Out of all the senses, smell is most closely linked to memory.",
    "Crocodile babies don't have sex chromosomes; the temperature at which the egg develops determines gender.",
    "The placement of a donkey's eyes in its' heads enables it to see all four feet at all times.",
    "An adult giraffe's tongue is 17 inches long.",
    "The Vandalur Zoo in Chennai is the First Zoo (1855) in India and one of the largest in South Asia.",
    "Most soccer players run 7 miles in a game.",
    "22-May-1990 Microsoft launched \"Windows 0\"O/s.",
    "a crocodile can't move its tongue",
    "Lima beans contain cyanide!",
    "A pound of potato chips costs 200 times more than a pound of potatoes.",
    "Nutmeg is extremely poisonous if injected intravenously.",
    "If a surgeon in Ancient Egypt lost a patient while performing an operation, his hands were cut off.",
    "A company in Taiwan makes dinnerware out of wheat, so you can eat your plate!",
    "the hottest chile in the world is the habanero",
    "you use 72 different muscles while speaking",
    "A rodent's teeth never stop growing.",
    "Only 51% of South Carolina high school students will graduate, the lowest of any state.",
    "If you were to roll a lung from a human body and out flat it would be the size of a tennis court.",
    "The Knock Nevis was a massive ship with '1504' ft length last used as a floating storage and offloading unit (FSO)",
    "A ball of glass will bounce higher than a ball made of rubber.",
    "Perth is Australia's windiest city",
    "Research indicates that babies who suck on pacifiers are more prone to ear aches.",
    "Goodyear Rubber Company researched and concluded that shoes wear out faster on the right foot than the left.",
    "A hard working adult sweats up to 4 gallons per day.",
    "In 2004, The Japanese Ice Cream Association promoted “raw horse flesh” ice cream in hopes that it would boost the popularity of ice cream!",
    "Lenny Kravitz's mother played the part of 'Helen' on 'The Jeffersons'.",
    "Every day 400000 babies are born and 140000 people die.",
    "The inventor of the Waffle Iron did not like waffles.",
    "X-rays of the Mona Lisa show that there are three completely different versions of the same subject, all painted by Leonardo Da Vinci, under the final portrait.",
    "Clinophobia is the fear of beds!",
    "it takes 5 years for an oyster to produce a medium sized pearl",
    "In Massachusetts, It is illegal to go to bed without first having a full bath.",
    "rabbits like licorice",
    "Male hospital patients fall out of bed twice as often as female hospital patients.",
    "The game of volleyball was invented in 1895 by William G. Morgan.",
    "41% of the moon is not visible from earth at any time.",
    "Whoopi Goldberg’s real name is Caryn Elaine Johnson.",
    "Every day, the average person swallows about a quart of mucous.",
    "Crocodiles are colour blind.",
    "'Dina Thanthi' was founded by S. P. Adithanar a lawyer trained in Britain and practised in Singapore with its first edition from Madurai in 194",
    "Duracell, the battery-maker, built parts of its new international headquarters using materials from its own waste.",
    "a hippopotamus can run faster than a man",
    "Most NASCAR Teams use nitrogen in their tires instead of air.",
    "90% of all volcanic activity occurs in the ocean",
    "most birds eat twice their body weight each day",
    "atychiphobia is the fear of failure",
    "Google's name is a play on the word googol which refers to the number 1 followed by one hundred zeroes.",
    "The creator of the NIKE Swoosh symbol was paid only $35 for the design.",
    "In Cleveland, Ohio it is illegal to catch mice without a hunting license.",
    "all owls lay white eggs",
    "On average, a person will spend about five years eating during his or her lifetime.",
    "Watermelons can cost up to $100 in Japan!",
    "Up to the age of six or seven months a child can breathe and swallow at the same time. An adult cannot do this.",
    "In Kentucky, it is illegal to carry ice-cream in your back pocket.",
    "there are 22 stars in the Paramount studios logo",
    "hippopotamuses have killed more people in Africa than any other animal",
    "due to gravitational effects you weigh is slightly less when the moon is directly overhead",
    "The mile is Latin for 1,000. The number of paces it took the average Roman!",
    "A raindrop is round but appears to be oval because gravitation pulls on the front of the raindrop as it is falling.",
    "Almonds are a member of the peach family.",
    "Some ribbon worms will eat themselves if they can't find any food.",
    "the first credit card was a Diner's Club card issued in 1950",
    "A sneeze can travel as fast as 100 miles per hour.",
    "dark roasted coffee beans contain less caffeine than medium roasted ones (the longer a coffee is roasted the more caffeine is burns off)",
    "Blueberry juice boosts memory.",
    "the average golf ball has 336 dimples",
    "after bananas a zoo gorilla's favorite food is celery",
    "There are more insects in one square mile of rural land than there are human beings in the world.",
    "you can smell a skunk 1.6km (1 mile) away",
    "The hair of an adult man or woman can stretch 25% of its length without breaking.",
    "It is impossible to lick your elbow. (know you gonna try this...)",
    "a whip makes a cracking sound because its tip moves faster than the speed of sound",
    "there are over 97,000 km (60,000 miles) of blood vessels in the average person",
    "A hardboiled egg will spin. An uncooked or softboiled egg will not.",
    "Beelzebub is Hebrew for 'Lord of the Flies'.",
    "the life span of a house fly is between 10 to 25 days",
    "MasterCard was originally called MasterCharge",
    "Babe Ruth wore No. 3 because he batted third.",
    "Elephants, lions, and camels roamed Alaska 12,000 years ago.",
    "flies can react to an object it sees and change direction in less than 30 milliseconds",
    "bananas contain no fat, cholesterol or sodium",
    "Bluebirds cannot see the color blue.",
    "When \"Harry Potter and the Prisoner of Azkaban\"was released in Great Britain the publisher asked stores not to sell the book until schools were closed for the day to prevent truancy.",
    "During WWII, because a lot of players were called to duty, the Pittsburgh Steelers and Philadelphia Eagles combined to become The Steagles.",
    "The most common time for a bank robbery is Friday, between 9 and 11 a.m. The least likely time is Wednesday, between 3 and 6 p.m.",
    "there are over 900,000 known species of insects",
    "Throughout its lifetime an elephant goes through six sets of teeth. The elephant starves to death once the sixth set of teeth falls out.",
    "Kite flying is a professional sport in Thailand.",
    "you take over 23,000 breaths everyday",
    "When your face blushes, the lining of your stomach turns red, too.",
    "Phobatrivaphobia is fear of trivia about phobias.",
    "onions are part of the lily family",
    "One barrel of petroleum holds 42 gallons.",
    "Baby robins eat 14 feet of earthworms every day.",
    "George Washington and Thomas Jefferson grew marijuana on their plantations!",
    "all of the cobble stones used to line the streets in New York were originally stones found in the hulls of Belgian ships ballast",
    "the first parachute jump from plane was in 1918 over France",
    "No 2 cornflakes are identical!",
    "the most abundant metal in the Earth's crust is aluminum",
    "when water freezes it expans by 9%",
    "The skeleton of a spider is located on the outside of the body. The name for this is exoskelton.",
    "a sharks top speed is 70kmh (44mph)",
    "Lightning strikes about 6,000 times per minute on this planet!",
    "Isaac Newton invented the cat door",
    "The Grateful Dead were once called 'The Warlocks'.",
    "the average bank teller loses $250 every year",
    "Christmas trees originated from Germany",
    "the makers of the board game Monopoly print over 50 billion dollars worth of Monopoly money every year",
    "your brain uses 25% of all the oxygen your breathe",
    "Black Whales are born white.",
    "deers don't like hay",
    "a baby fetus develops fingerprints at eighteen weeks",
    "only female mosquitoes bite",
    "In an average lifetime a person will walk the equivalent of three times around the world.",
    "Israel's Dead Sea is 1,312 feet below sea level.",
    "Warren Beatty once worked as a rat-catcher!",
    "Nachos is the food most craved by pregnant women.",
    "Eddie Cochran's last recording before he died was Three Steps to Heaven!",
    "Colgate's first toothpaste came in a jar.",
    "The Blue Whale's tongue weighs more than an adult elephant!",
    "The sting from a killer bee contains less venom than the sting from a regular bee!",
    "The First Wireless TV Remote was invented by 'Eugene Polley' in 195",
    "the average elephant produces 22kg (50 pounds) of dunn each day",
    "the 3 most common languages in the world are Mandarin Chinese, Spanish and English",
    "It takes up to four hours to hard boil an ostrich egg.",
    "Switzerland has the highest per-capita consumption of soft drinks in the world.",
    "Coca Cola was founded by Joseph A Biedenharn",
    "One quarter of the bones in your body are in your feet!",
    "a hard boiled eggs spin (uncooked or soft boiled don't)",
    "An eagle can attack, kill, and carry away an animal as large as a small deer.",
    "Taphephobia is the fear of being buried alive!",
    "All of the Earth's continents are wider at the north than in the south - and nobody knows why.",
    "penguins are only found in the southern hemisphere primarily in Antarctica (excluding zoos above the equator)",
    "Windmills always turn anti-clockwise. Except for the windmills in Ireland!",
    "Diet Coke was introduced in 1982",
    "acorns are poisonous to humans (if eaten it can cause damage to your kidneys)",
    "Only female bees work.",
    "An elephant's tooth can weigh as much as 12 pounds.",
    "Microsoft made $16,005 in revenue in its first year of operation.",
    "Sun network was established in Apr 14 1993 and has over 20 television channels in four languages now.",
    "Tug of War was an Olympic event between 1900 and 1920.",
    "Most lipstick contains fish scales!",
    "Burt Reynolds is a Cherokee Indian.",
    "In most advertisements, the time displayed on a watch or clock is usually 10:10.",
    "Dueling is legal in Paraguay, as long as both parties are registered blood donors.",
    "an elephants ears are used to regulate body temperature",
    "It is illegal NOT to smile in Pocatello, Idaho!",
    "the past tense for the English word 'dare' is 'durst'",
    "the little hole in some sinks that lets the water drain out instead of flowing is called a 'porcelator'",
    "The giant squid has the largest eyes in the world.",
    "the Statue of Liberty weighs over 225 tons",
    "a platypus can eat its weight in worms every day",
    "the longest one syllable word in the English language is 'screeched'",
    "Tigers have striped skin, not just striped fur!",
    "The largest diamond ever found was an astounding 3,106 carats!",
    "Forest fires move faster uphill than downhill.",
    "you brain weights 2% of your body weight though uses 20% of all oxygen you breathe and 15% of the bodys blood supply",
    "It was once against the law to slam your car door in a city in Switzerland!",
    "In Florida, Penalty for horse theft is death by hanging.",
    "Over 98% of Japanese people are cremated after they die.",
    "Ears of corn always have an even number of rows of kernels.",
    "flamingoes can live up to 80 years old",
    "moths have white blood",
    "Louisiana is the only state that grows in land area every year (Due to alluvial deposits from the Mississippi River).",
    "Tapeworms range in size from about 04 inch to more than 50 feet in length.",
    "aichmophobia is the fear of needles and pointed objects",
    "Avocados are poisonous to birds.",
    "25% of your bones are located in your feet.",
    "a lions feed once every 3 to 4 days",
    "Jimi Hendrix, Janis Joplin, and Jim Morrison were all 27 years old when they died.",
    "Nose prints are used to identify dogs, just like humans use fingerprints!",
    "the first aluminum drink can was introduced in 1964",
    "56% of typing is completed by your left hand",
    "Fish have been on the earth for more than 450 million years.",
    "lettuce is the worlds most popular green vegitable",
    "brontology is the study of thunder",
    "In 1980, the city of Detroit presented Saddam Hussein with a key to the city.",
    "Mount Everest is 8.9km (5.5 miles) high",
    "Apple company was founded by Steve Jobs Steve Wozniak and Ronald Wayne on April 1 197",
    "There are roughly 144000 mosquitoes for every person on earth.",
    "Only male fireflies can fly.",
    "the lie detector was invented in 1921",
    "Most dust particles in your house come from dead skin.",
    "Someone on Earth reports seeing a UFO every three minutes.",
    "All the platinum ever mined would fit into an average-sized living-room!",
    "Female canaries cannot sing.",
    "a bear in hibernation loses up to 25% of its body weight",
    "The odds of getting a hole-in-one in golf are estimated at about 18,000-to-1.",
    "bees have 4 wings",
    "The first bowler to take 10 wickets in a Test innings was Jim Laker in 195",
    "Barbie's full name is Barbara Millicent Roberts.",
    "It was once against the law to have a pet dog in a city in Iceland!",
    "Size of Football goal post is 32m length and 44m in width",
    "Contrary to popular belief, putting sugar in a car's gas tank will NOT ruin its engine.",
    "Crushed cockroaches can be applied to a stinging wound to help relieve the pain.",
    "Brazil got its name from the Brazilian nut (not the other way around)",
    "It is illegal to hunt camels in the state of Arizona.",
    "Streets in Japan do not have names.",
    "Buttermilk does not contain any butter.",
    "Over one million stray dogs live in the New York City metropolitan area.",
    "City dwellers have longer, thicker, denser nose hairs than country folks do.",
    "you have over 600 muscles",
    "A Boeing 747 airliner holds 57,285 gallons of fuel.",
    "A killer whale’s heart beats 30 times a minute under water, 60 times a minute on the surface.",
    "the atomic symbol for iron is Fe (the original name for iron was Ferric)",
    "A cockroach can live several weeks with its head cut off - it dies from starvation!",
    "Robert Browning (English poet) born on 07 May 1812 (today).",
    "The country of Brazil is named after the brazil nut.",
    "The great wall of China is 1,400 miles long!",
    "-40 degrees Celsius is equal to -40 degrees Fahrenheit.",
    "Your heart pumps about 2,000 gallons of blood each day!",
    "Leonardo DiCaprio got his first ‘onscreen kiss’ from a man!",
    "Only 1 person in 2 billion will live to be 116.",
    "The original Toby jugs were modelled on Harry 'Toby' Elwes a Yorkshireman!",
    "Muralidharan's wickets list. Craig McDermott (1st) Stephen Fleming (100) Ben Hollioake (200) Shaun Pollock (300) Henry Olonga(400) Michael Kasprowicz (500) Khaled Mashud (600) Syed Rasel (700) Pragyan Ojha (800).",
    "John Cadbury founded the Cadbury chocolate company in England in 1842 producing the first chocolate bars",
    "90% people depend on alarm clocks to wake up",
    "Real diamonds can be made from peanut butter!",
    "The adult human body requires about 88 pounds of oxygen daily.",
    "a blue whale can weigh as much as 30 elephants and as long as 3 large tour buses",
    "honey enters your blood stream within 20 minutes of being eaten",
    "It is estimated that at any one time, 0.7% of the world's population are drunk.",
    "Over 4.6 million Whopper sandwiches are sold at Burger King every day!",
    "everyday is a holiday somewhere in the world",
    "At 120 miles per hour, a Formula One car generates so much downforce that it can drive upside down on the roof of a tunnel.",
    "Three kinds of blood vessels are Arteries Vanes and Caterpillars.",
    "Mussolini dodged the Italian draft.",
    "diamonds mined in Brazil are much harder than those found in Africa",
    "The metal instrument used in shoe stores to measure feet is called the Brannock device.",
    "the softest known mineral is talc",
    "The only 15 letter word that can be spelled without repeating a letter is uncopyrightable!",
    "One quarter of the human brain is used to control the eyes.",
    "You can start a fire with ice.",
    "a chameleon's tongue is twice as long as its body",
    "Michael Keaton's original name is Michael Douglas.",
    "MTV (Music Television) made its debut at 12:01 a.m. August 1st 1981 (the first music video shown 'Video killed the radio star' by the Buggles)",
    "The sound made by a 'Snake' is called 'Hiss'.",
    "About 400 different kinds of microbes live on and in the human body.",
    "Mexico City is sinking at a rate of 18 inches per year!",
    "sharks have been on Earth for over 400 million years",
    "a snail can sleep for 3 years",
    "Most cell phone antennas have no purpose other than to make people believe that flipping up a 2 inch antenna just gave them better reception. They are not connected to any circuitry.",
    "Sound travels fifteen times faster through steel than through air.",
    "Brazil accounts for 1/3 of the world's coffee production",
    "chicken drumsticks contain the least amount of meat on a chicken",
    "ice skating rinks always go counter clock wise (for the majority of people that are right handed needing to hang onto the rail)",
    "'Vinoo Mankad' is the only indian cricket player to bat in all positions (1 to 11).",
    "Until President Kennedy was killed, it wasn’t a federal crime to assassinate the President.",
    "Annually, the amount of garbage that is dumped in the world's oceans is three times the weight of fish that is caught from the oceans.",
    "ferrets sleep between 18 - 20 hours a day",
    "cooking or freezing does not reduce the heat (spiciness) of a chile pepper",
    "the ideal temperature to fall asleep is between 18-30c (64-86f)",
    "The dial tone of a normal telephone is in the key of \"F\".",
    "there are over 80,000 different species of ants",
    "unless food is mixed with saliva you can't taste it",
    "The average city dog lives three years longer than the average country dog.",
    "toilets use 35% of indoor water use",
    "It was illegal to sell E.T. dolls in France because there is a law against selling dolls without human faces.",
    "Castor oil is used as a lubricant in jet planes.",
    "the bones of a pigeon weigh less than its feathers",
    "the typical wave height from Pacific tsunami is between 6 - 9 metres",
    "If a car is travelling at 55 miles per hour it will travel 56 feet before the driver can shift his foot from the accelerator to the brake.",
    "The game of snakes & ladders was created by the 13th century poet saint Gyandev.",
    "the moon is 27% the size of the Earth",
    "the world's knowledge is growing so fast that 90% of what we will know in 50 years time will be discovered in those 50 years",
    "The first toilet being flushed in a motion picture was in the movie Psycho.",
    "Cats’ urine glows under a black light.",
    "crocodiles swallow rocks to help them dive deeper",
    "Fear of 'heights' is called as 'Acrophobia'.",
    "A toaster uses almost half as much energy as a full-sized oven.",
    "less than 20% of shark attacks are fatal",
    "originally in 1886 Coca Cola was introduced as an 'intellectual beverage' to boost brain power",
    "the blueprints for the Eiffel Tower covered more than 14,000 square feet of drafting paper",
    "Dating back to the 1600's, thermometers were filled with Brandy instead of mercury.",
    "4.5 pounds of sunlight strike the Earth each day.",
    "Hummingbirds can weigh less than a penny!",
    "Unlike dogs, pigs, and some other mammals, humans cannot taste water. They taste only the chemicals and impurities in the water.",
    "A group of geese on the ground is a gaggle, a group of geese in the air is a skein!",
    "camels can drink 94 litres (25 gallons) of water in less than 3 minutes",
    "It takes about a week to make a jelly bean.",
    "Food can only be tasted if it is mixed with saliva.",
    "you have fewer muscles than a caterpillar",
    "an ostrich's eye is bigger than its brain",
    "Niagara Falls could fill 4,000 bathtubs every second",
    "There are more bacteria in your mouth than there are people in the world.",
    "the first train reached a top speed of only 8 kmh (5 mph)",
    "Instead of a birthday cake, many children in Russia are given a birthday pie.",
    "the hardest substance in the human body is enamel",
    "the first letters of the months July through to November spell JASON",
    "Mathematical signs fact: 12+3-4+5+67+8+9100",
    "Einstein slept 10 hours a night",
    "Japanese people don't have middle names",
    "If you toss a penny 10,000 times, it will not be heads 5,000 times, but more like 4,950. The heads picture weighs more, so it ends up on the bottom.",
    "more people die from falling coconuts then from shark attacks",
    "Spotted skunks do handstands before they spray.",
    "One in three snake bite victims is drunk. One in five is tatooed.",
    "dolphin's can detect underwater sounds from 24 km (15 miles) away",
    "the word 'uncopyrightable' is the is the only 15 letter word that can be spelled without repeating any letter",
    "It takes 492 seconds for sunlight to reach the Earth!",
    "Paper money is not made from wood pulp but from cotton. This means that it will not disintegrate as fast if it is put in the laundry.",
    "Persia changed its name to Iran in 1935.",
    "When water gets cool enough molecular movement is slowed enough that the molecules stick to each other and form ice crystals.",
    "Henry Ford produced the model T only in black because the black paint available at the time was the fastest to dry.",
    "the world's most expensive spice is saffron",
    "The longest word in the English language with no vowels is Rhythms!",
    "Canada is an Indian word meaning 'Big Village'.",
    "raindrops are not tear shaped (they more resemble the shape of a tiny hamburger bun)",
    "Bulls are colorblind, therefore will usually charge at a matador's waving cape no matter what color it is -- be it red or neon yellow!",
    "the word 'taxi' is spelled the same in English, German, French, Swedish, and Portuguese",
    "Bananas aren’t fruit! They are a type of herb.",
    "A jellyfish is 95% water",
    "John F. Kennedy was buried without his brain after it was lost during the autopsy!",
    "Everton FC used to be called St Domingo's FC!",
    "it takes 110 silkworm cocoons to make an average tie",
    "Infants spend more time dreaming than adults do.",
    "crocodiles continually grow new sets of teeth to replace old ones",
    "your tongue is the fastest healing part of your body",
    "There is a species of clam that can grow up to four feet long and weigh up to 500 pounds.",
    "It's against the law to pawn your dentures in Las Vegas!",
    "the word typewriter is the longest word that can be typed using only the top row of a keyboard",
    "Only two in one thousand diamonds are considered truly colorless.",
    "Car airbags kill 1 person for every 22 lives that they save.",
    "One gallon of used motor oil can ruin approximately one million gallons of fresh water.",
    "In England, in the 1880's, Pants was considered a dirty word!",
    "One ragweed plant can release as many as one billion grains of pollen!",
    "gunpowder is formed by mixing charcoal, saltpetre and sulphur",
    "dolphins can kills sharks by ramming them with their snout",
    "The venom of the king cobra is so deadly that just one gram of it can kill 150 people.",
    "Over 50% of lottery players go back to work after winning the jackpot.",
    "heliophobia is the fear of sunlight",
    "A Koala Bear sleeps 22 hours of every day.",
    "Astronauts get taller when they are in space.",
    "Avocados have more protein than any other fruit.",
    "The Lucky Dog (1921) is the first film to include both members 'Stan Laurel' and 'Oliver Hardy' later known as Laurel and Hardy.",
    "Jackie chan's real name is 'Chan Kong-sang' and was born on 7-April-1954 in Hong Kong.",
    "Whispering is more wearing on your voice than a normal speaking tone.",
    "Coca-Cola originally contained cocaine",
    "cucumbers are 96% water.",
    "a rat can tread water for 3 days",
    "When a person dies, hearing is usually the last sense to go.",
    "employees are more likely to book holidays off work on a Monday that any other week day",
    "Dragonfly eye contains 30000 lenses.",
    "the first metered taxi was introduced in 1907",
    "a dolphins top speed is 60kmh (37mph)",
    "Apple seeds are poisonous!",
    "Shakespeare invented the words 'assassination' and 'bump'",
    "the average person sheds .7kg (1.5 pounds) of skin each year",
    "In the year 2000, Pope John Paul II was named an Honorary Harlem Globetrotter!",
    "In Natoma, Kansas, it's illegal to throw knives at men wearing striped suits",
    "Until 1990, the deadly poison mercury was used in about 30% of latex paints!",
    "the first taxi service began in New York in 1907",
    "The electric chair was invented by a dentist!",
    "a garfish has green bones",
    "Spain's largest source of income is from tourism",
    "the average human drinks over 60,566 litres (16,000 gallons) of water in a lifetime",
    "Most tropical marine fish could survive in a tank filled with human blood.",
    "there are 2,598,960 possible hands in a 5 card poker game",
    "Penguins can convert salt water into fresh water.",
    "It takes 40 minutes to hard boil an ostrich egg.",
    "Medical studies show that intelligent people have more copper and zinc in their hair.",
    "A 'face-off' in hockey was originally called a 'puck-off'.",
    "The D/L method (used in Cricket) was devised by two English statisticians Frank Duckworth and Tony Lewis.",
    "In France, it is legal to marry a dead person!",
    "the most common Spanish surname is Garcia",
    "butterflies taste with their back feet",
    "Women end up digesting most of the lipstick they apply.",
    "a banana contains 75% water",
    "'Mango' is india's national fruit.",
    "By the age of 60, most people have lost 50% of their taste buds.",
    "Last 2 European countries to let women vote:  Switzerland (1971) and Leichtenstein (1984).",
    "Woodpecker scalps, porpoise teeth and giraffe tails have all been used as money.",
    "Any space vehicle must move at a rate of 7 miles per second in order to escape the earth's gravitational pull.",
    "the subject of the first printed book in England was about chess",
    "Next to Warsaw, Chicago has the largest Polish population in the world.",
    "Brad Pitt has been smoking since the sixth grade!",
    "It was discovered on a space mission that a frog can throw up.",
    "Bill Gates began programming computers at the of age 13",
    "Wearing yellow makes you look bigger on camera; green, smaller.",
    "Tablecloths were originally meant to be served as towels with which dinner guests could wipe their hands and faces after eating!",
    "queen termites can live up to 50 years",
    "that you burn more calories eating celery than it contains (the more you eat the thinner you become)",
    "gorillas sleep 14 hours a day",
    "the world's first paved streets were laid in Rome in 170 B.C.",
    "if you filled a matchbox with gold it could be flattened into a sheet the size of a tennis court",
    "months that start on a Sunday will always have a Friday the 13th",
    "In Spain, it is common to pour chocolate milk on cereal for breakfast.",
    "In San Salvador, drunk drivers can be punished by death before a firing squad.",
    "and the viewers were never told!",
    "The name Wendy was made up for the book Peter Pan.",
    "If it isn’t moving a frog can’t see it. If the frog can’t see it, he won’t eat it.",
    "dendrophobia is the fear of trees",
    "melissophobia is the fear of bees",
    "Wyoming was the first state to allow women to vote.",
    "It is now possible to print human skin with an inkjet printer!",
    "The king of hearts is the only king without a moustache on a standard playing card!",
    "moths have no stomach",
    "Real name of Sonia Gandhi is 'Edvige Antonia Albina Maino'.",
    "the number 1 reason why people purchase a mobile phone is for safety",
    "Babies start dreaming even before they're born.",
    "More than 25% of the world's forests are in Siberia.",
    "the human eye blinks over 4,200,000 times a year",
    "only pregnant females polar bears hibernate",
    "pop corn was invented by the Aztec Indians",
    "The capital of Spain is 'Madrid'.",
    "A person will burn 7% more calories if they walk on hard dirt compared to pavement.",
    "Until the 1960's men with long hair were not allowed to enter Disneyland.",
    "Fingernails grow nearly 4 times faster than toenails!",
    "the first James Bond movie was called 'Dr. No'",
    "A bird 'chews' with its stomach.",
    "Albert Einstein never knew how to drive a car",
    "The Zip Code 12345 is assigned to General Electric in Schenectady, New York.",
    "the greyhound is the fastest dog and can reach speeds of up to 72kph (45mph)",
    "Al Capone's business card said he was a used furniture dealer.",
    "Three Mile Island is only 2 1/2 miles long.",
    "the Empire State Building in New York weighs over 365,000 tons",
    "If you’re over 100 years old, there’s an 80% chance you’re a woman.",
    "only 4 out of 20,000 species of bees produce honey",
    "In India, people are legally allowed to marry a dog!",
    "an ostriches life span is 40-45 years",
    "A jiffy is an actual unit of time for 1/100th of a second. Thus the saying, I will be there in a jiffy.",
    "Indian national football team qualified for the 1950 World Cup finals in Brazil but could not appear as they still played bare feet at the time.",
    "the Eiffel Tower is over 300m (984 ft) tall",
    "the study of insects is called entomology",
    "all hurricanes form over the sea and can last up to 10 days",
    "porcupines float in water",
    "there is no rice in rice paper",
    "The fastest speed a falling raindrop can hit you is 18mph.",
    "India used to be the richest country in the world until the British invasion in the early 17th Century.",
    "a dragonfly can fly at 40kph (25mph)",
    "The highest point in Pennsylvania is lower than the lowest point in Colorado!",
    "China is the source of 70% of the worlds pirated goods.",
    "New Zealands first hospital was opened in 1843",
    "In Haiti, only 1 out of every 200 people own a car.",
    "Many people in parts of China eat insects. Some common insects are bean worms, scoprions, and locusts.",
    "a flea can jump 350 times its body length",
    "Barbie's full name is Barbara Millicent Roberts.",
    "Tamil actress Manorama's first tamil film is \"Maalayitta Mangai\"released in 195",
    "Is bottled water worth it?  'Evian' spelled backwards is 'naive'.",
    "More than 100 pizza box-related patents have been issued since 1976!",
    "the film 'Mary Poppins' was filmed entirely indoors",
    "U-Haul is the world's largest advertiser in the Yellow Pages.",
    "Pierce Brosnan once worked with the circus as a fire eater!",
    "Venetian blinds were invented in Japan",
    "an iguana can stay under water for 28 minutes",
    "some dinosaurs had tails over 13m (45 feet) long",
    "there are over 2,500 different types of mushrooms",
    "The first bomb dropped by the Allies on berlin in WW2 killed the only elephant in the Berlin Zoo.",
    "Google.com - After entering search keyword On clicking 'I'm feeling lucky' button it will open the first result's website directly.",
    "The sun is 330,330 times larger than the earth.",
    "the largest exporter of sugar is Cuba",
    "Some octopuses have been known to eat their arms off when they are exposed to stressful situations.",
    "Only 1% of bacteria cause disease.",
    "You mostly breathe from only one nostril at a time!",
    "the average person has 10,000 taste buds",
    "the WD in WD-40 stands for Water Displacer",
    "William Morgan invented volleyball in 189",
    "You inhale about 700,000 of your own skin flakes each day.",
    "employees of the Vatican pay no income tax",
    "Gold leaf is attached to paper or plaster with egg whites, the same now as in ancient times!",
    "a hummingbird's heart beats at over a 1,000 times a minute",
    "The first hard drive available for the Apple II had a capacity of only 5 megabytes.",
    "There is enough fuel in a full tank of a Jumbo Jet to drive an average car four times around the world.",
    "Australia's Great Barrier Reef is 1,250 miles long!",
    "A 'jiffy' is an actual unit of time for 1/100th of a second!",
    "Our normal body temperature is 37°C (99°F).",
    "the Moons diameter is 3,476km",
    "Intelligent people have more zinc and copper in their hair.",
    "The first coast-to-coast telephone line was established in 191",
    "More Monopoly money is printed in a year, than real money printed throughout the world!",
    "Leonardo da Vinci was dyslexic, and he often wrote backwards.",
    "The longest word in the English language is pneumonoultramicroscopicsilicovolcanoconioses!",
    "People with blue eyes are better able to see in the dark.",
    "cats spend 66% of their life asleep",
    "Liquid TIDE laundry detergent glows under a blacklight.",
    "A person infected with the SARS virus, has a 95-98% chance of recovery.",
    "wearing headphones for just an hour will increase the bacteria in your ear by 700 times",
    "more than 75% of all countries are north of the equator",
    "The average housefly weighs 10 to 15 millionths of a pound.",
    "the Nile river flows North",
    "One punishment for an adulterous wife in medieval France was to make her chase a chicken through town naked.",
    "the night vision of tigers is 6 times better than humans",
    "the most common time for a wake up call is 7am",
    "Rajiv Gandhi was born on August 20 194",
    "Ants don’t sleep.",
    "Moscow weathermen can be fined for inaccurate weather forecasting!",
    "The 'vintage date' on a bottle of wine indicates the year the grapes were picked, not the year of bottling!",
    "Goat's milk is used more widely throughout the world than cow's milk.",
    "a group of whales is called a pod",
    "'King Cobra' is the National Reptile of India.",
    "The state of Wyoming is named after a valley in Pennsylvania.",
    "cats have over 100 vocal chords",
    "If the chemical sodium is dropped into water it will immediately and violently explode.",
    "A man named Charles Osborne had the hiccups for 69 years!",
    "goldfish can see both infrared and ultraviolet light",
    "the Pacific Ocean is the world's largest",
    "Martha Stewart became a billionaire while in prison.",
    "1 square inch of human skin contains 625 sweat glands.",
    "42% of men and women 25% don't wash their hands after using a public toilet",
    "The Nobel Peace Prize medal depicts 3 naked men with their hands on each others shoulders.",
    "More than ten people a year are killed by vending machines.",
    "The sound made by a 'Lion' is called 'Roar'.",
    "the first Lifesaver flavor was peppermint",
    "The 7-Eleven Extreme Gulp is 50% bigger than the volume of the human stomach!",
    "Under extreme stress, some octopuses will eat their own arms.",
    "the oldest exposed surface on Earth is New Zealand's south island",
    "FIFA 2006 World Cup: Italy won their fourth world crown in Germany beating France on penalties in Berlin on 09 July 200",
    "An egg will float if placed in water in which sugar has been added.",
    "Club Direct, a travel insurance company in Britain, provides insurance plans for protection from falling coconuts.",
    "An elephant trunk has no bone but 40,000 muscles.",
    "'South China Sea' is the largest sea in the world (2974600 sq km)",
    "At  one 'feeding', a mosquito can absorb one and a half times its own weight in blood.",
    "Each day is longer than the previous on by 0.00000002 seconds which is 13 seconds each century!",
    "Nearly 50% of the world’s scientists are assigned to military projects.",
    "If you are locked in a completely sealed room, you will die of carbon dioxide poisoning first before you will die of oxygen deprivation.",
    "The two planes crashed in Twin towers are \"Q33 NY (Flight 11)\"and 'Flight 77'.(More interesting Type \"Q33 NY\"in Ms-Word with font size 48 and font name as 'WINGDINGS'and hit 'Enter' key).",
    "reindeer hair is hollow inside like a tube",
    "It takes six months to build a Rolls Royce...and 13 hours to build a Toyota.",
    "Camels are called \"ships of the desert\"because of the way they move not because of their transport capabilities.",
    "The lion that roars in the MGM logo is named Volney.",
    "A species of earthworm in Australia grows up to 10 feet in length.",
    "Among older men, vanilla is the most erotic smell.",
    "minus 40C is exactly the same temperature as minus 40F",
    "the brand Nokia is named after a place in Southern Finland",
    "Approximately one-third of the population can't snap their fingers!",
    "The IRS employees tax manual has instructions for collecting taxes after a nuclear war.",
    "Identical twins do not have identical fingerprints.",
    "James Bond is also known as Mr. Kiss-Kiss-Bang-Bang.",
    "trees do not have life expectancies (most can grown indefinitely)",
    "In Australia, Burger King is called Hungry Jack's.",
    "your foot and your forearm are the same length",
    "A nest of young puppies is called as 'Liter'.",
    "23% of all photocopier faults worldwide are caused by people sitting on them and photocopying their butts.",
    "A dragonfly has a lifespan of 24 hours.",
    "A Giraffe has the same number of bones in its neck as a man.",
    "catoptrophobia is the fear of mirrors",
    "California has issued at least 6 drivers licenses to people named Jesus Christ.",
    "The first two years of a dog's life are equal to 24 human years.",
    "when born a baby giraffe is 1.8m (6ft) tall",
    "Our Indian flag was designed by \"Pingali Venkayya\"and it became our official flag on '22 July 1947'.",
    "Famous lyricist \"Vairamuthu\"was born on 13-July-1953. He received the National Award 5 times in his career so far.",
    "a squid has 10 tentacles",
    "The average human body contains enough fat to make seven bars of soap.",
    "A comet's tail always points away from the sun.",
    "The Atlantic Ocean is saltier than the Pacific Ocean.",
    "bulletproof vests, fire escapes, windshield wipers, and laser printers were all all invented by women",
    "Neither the saxophone, the tuba, the coronet, nor the valve trumpet existed before 1800.",
    "When Britney Spears books into hotels she uses the name 'Allota Warmheart' so that nobody will recognize her.",
    "The elephant is one of the few mammals that can't jump!",
    "the first crossword puzzle appeared in 1913",
    "Chop Suey was invented in New York!",
    "We blink 25 times a minute.",
    "the first rugby club was formed in 1843",
    "A baby octopus is about the size of a flea at birth.",
    "A man once sued his doctor because he survived his cancer longer than the doctor predicted.",
    "During his or her lifetime, the average human will grow 590 miles of hair.",
    "Karate actually originated in India, but was developed further in China.",
    "a Sphygmomanometer measures blood pressure",
    "There are more than 50,000 earthquakes throughout the world every year!",
    "honey is the only natural food which never spoils",
    "A person swallows approximately 295 times while eating dinner.",
    "The Nestles haven't run Nestle since 1875.",
    "it's possible to lead a cow up stairs but not down",
    "Mosquitoes prefer children to adults, blondes to brunettes.",
    "that in the 17th century the value of pi was known to 35 decimal places (today to 1.2411 trillion)",
    "The IRS processes more than 2 billion pieces of paper each year.",
    "The Basenji dog is the only dog that is not able to bark.",
    "it takes 1 week to make a jelly bean",
    "A group of rats is called as 'Colony'.",
    "In 1998, Sony accidently sold 700,000 camcorders that had the technology to see through people's clothes.",
    "If you are bitten by a poisonous snake, and fail to receive medical attention, you still have a 50% chance of survival.",
    "For people that are lactose intolerant, chocolate aids in helping milk digest easier.",
    "there are 31,557,600 seconds in a year",
    "Famous billionaire Howard Hughes stored his own urine in large bottles.",
    "During menstruation, the sensitivity of a woman's middle finger is reduced.",
    "Panophobia is the fear of everything.",
    "The longest recorded flight of a chicken is 13 seconds!",
    "75% of people wouldn't give up their spouse for a night for a $1,000,000",
    "Your skeleton keeps growing until you are about 35, then you start to shrink.",
    "Rubberbands last longer when refrigerated.",
    "Seagate introduced the first hdd for pcs in 197It held 5 M.B of data.",
    "The heart of an astronaut actually gets smaller when in outer space.",
    "the average woman will consume over 2.7kg (6 pounds) of lipstick in their lifetime",
    "Dandelion root can be roasted and ground as a coffee substitute.",
    "The word \"diamond\"comes from the Greek word \"adamas\"which means \"unconquerable.\"",
    "In just about every species of mammal, the female lives longer than the male.",
    "most cows produce more milk when they listen to music",
    "Blaise Pascal worked on the calculator for three years between 1642 and 1645 called as 'Pascaline'.",
    "All clams start out as males; some decide to become females at some point in their lives.",
    "the side of a hammer is called a cheek"
]